# Gazpromneft_backend_school
---
## Содержание

1. [Спринт 1](#Спринт-1)
+ [Ближайший ноль](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_1/sprint1_1.py)
+ [Ловкость рук](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_1/sprint1_2.py)
2. [Спринт 2](#Спринт-2)
+ [Правильные скобочные последовательности](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_2/psp.py)
+ [Составить самое большое число](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_2/largest_number.py)
3. [Спринт 3](#Спринт-3)
+ [Двоичная система счисления](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_3/binary_transform.py)
+ [Палиндром](https://github.com/kkkebo/gazpromneft_backend_school/blob/main/Sprint_3/is_palindrome.py)

---
## Спринт 1
---
### 1 - Ближайший ноль (Максимальная оценка: 15 + 3 доп.)

Тимофей ищет место, чтобы построить себе дом. Улица, на которой он хочет жить, имеет длину n, то есть состоит из n
одинаковых идущих подряд участков. Каждый участок либо пустой, либо на нём уже построен дом.
Общительный Тимофей не хочет жить далеко от других людей на этой улице. Поэтому ему важно для каждого участка знать
расстояние до ближайшего пустого участка. Если участок пустой, эта величина будет равна нулю — расстояние до самого
себя.
Помогите Тимофею посчитать искомые расстояния. Для этого у вас есть карта улицы. Дома в городе Тимофея нумеровались в
том порядке, в котором строились, поэтому их номера на карте никак не упорядочены. Пустые участки обозначены нулями.

**Формат ввода**

Записаны n целых неотрицательных чисел — номера домов и обозначения пустых участков на карте (нули). Гарантируется, что
в последовательности есть хотя бы один ноль. Номера домов (положительные числа) уникальны и не превосходят 109.

**Формат вывода**

Для каждого из участков выведите расстояние до ближайшего нуля. Числа выводите в одну строку, разделяя их пробелами.

**Пример 1**

Вход:

0 1 4 9 0

Выход:

0 1 2 1 0

**Пример 2**

Вход:

0 7 9 4 8 20

Выход:

0 1 2 3 4 5

---
### 2 - Ловкость рук (Максимальная оценка: 10 + 4 доп.)

Игра «Тренажёр для скоростной печати» представляет собой поле из клавиш 4x4. В нём на каждом раунде появляется
конфигурация цифр и точек. На клавише написана либо точка, либо цифра от 1 до 9.
В момент времени t игрок должен одновременно нажать на все клавиши, на которых написана цифра t. Гоша и Тимофей могут
нажать в один момент времени на k клавиш каждый. Если в момент времени t нажаты все нужные клавиши, то игроки получают 1
балл.
Найдите число баллов, которое смогут заработать Гоша и Тимофей, если будут нажимать на клавиши вдвоём.

**Формат ввода**

В первой строке дано целое число k (1 ≤ k ≤ 5).
В четырёх следующих строках задан вид тренажёра –— по 4 символа в каждой строке. Каждый символ —– либо точка, либо цифра
от 1 до 9. Символы одной строки идут подряд и не разделены пробелами.

**Формат вывода**

Выведите единственное число –— максимальное количество баллов, которое смогут набрать Гоша и Тимофей.

**Пример 1**

| Ввод | Вывод |
|------|-------|
| 3    | 2     |
| 1231 |       |
| 2..2 |       |
| 2..2 |       |
| 2..2 |       |

**Пример 2**

| Ввод | Вывод |
|------|-------|
| 4    | 1     |
| 1111 |       |
| 9999 |       |
| 9911 |       |
| 1111 |       |

**Пример 3**

| Ввод | Вывод |
|------|-------|
| 4    | 0     |
| 1111 |       |
| 1111 |       |
| 1111 |       |
| 1111 |       |
---
## Спринт 2
---
### 1 - Правильные скобочные последовательности (12 баллов + 3 доп)
Необходимо реализовать функцию, генерирующую скобочную
последовательность, в зависимости от входного параметра ( n = 0…10 ) 
Правило генерации следующее:
+ “(” должна идти раньше “)” 
+ Длина последовательности 2n
+ Необходимо выполнить перебор всевозможных вариантов в 
лексикографическом порядке

**Примеры**

| Ввод | Вывод  |
|------|--------|
| 2    | (())   |
|      | ()()   |
| 3    | ((())) |
|      | (()()) |
|      | (())() |
|      | ()(()) |
|      | ()()() |

**Примечание**: Обратите внимание, что у 2 (()) идет раньше, чем ()(). Это связано с первым правилом ( “(” должна идти раньше “)” ). Аналогично с остальными

**Шаблон**
    
    def psp(n: int) -> str: 
    psp(int(input()))

### 2 - Составить самое большое число (15 баллов + 3 доп)
Необходимо составить наибольшее число из числа предложенных. 
На вход поступает два параметра:
+ количество чисел n ≤ 100
+ строка с n числами, записанными через пробел. Каждое отдельное число не 
превосходит 1000

**Примеры**

| Ввод       | Вывод  |
|------------|--------|
| 3          | 78321  |
| 1 783 2    |        |
| 5          | 542210 |
| 2 4 5 2 10 |        |

**Шаблон**

    def largest_number(n: int, numbers: str) -> str: 
    print(largest_number(input(), input()))

---
## Спринт 3
---
### 1 - Двоичная система счисления (12+3)
Реализуйте функцию, которая переводит число из десятичной системы счисления в двоичную. **Встроенные методы языка программирования использовать нельзя!**

**Примеры**

| Ввод | Вывод |
|------|-------|
| 5    | 101   |
| 14   | 1110  |
---

### 2 - Палиндром (12+3)
Определите, является ли строка палиндромом. Учитываются только буквы и 
цифры, заглавные и строчные буквы считаются одинаковыми.Буквы могут быть 
только латинские. Фраза может состоять из строчных и прописных латинских букв, цифр, знаков препинания.

Функция возвращает True, если фраза является палиндромом, иначе - False

**Примеры**

| Ввод                           | Вывод |
|--------------------------------|-------|
| A man, a plan, a canal: Panama | True  |
| zo                             | False |
---
